define(function(require, exports, module) {
	"use strict";
	
	require('raphael');
	
	var sandbox = require('sandbox.kpi.fbmi');
	var MainView = require('./view/main');
	var bmiInst = [];
	
	var branchMap = {
		"0800012900":"上海分公司",
		"0800011000":"北京分公司",
		"0800011100":"天津分公司",
		"0800011200":"河北分公司",
		"0800011600":"山西分公司",
		"0800011900":"内蒙古分公司",
		"0800012210":"辽宁分公司",
		"0800012220":"大连分公司",
		"0800012400":"吉林分公司",
		"0800012600":"黑龙江分公司",
		"0800013000":"江苏分公司",
		"0800013310":"浙江分公司",
		"0800013320":"宁波分公司",
		"0800013600":"安徽分公司",
		"0800013900":"福建分公司",
		"0800013930":"厦门分公司",
		"0800014200":"江西分公司",
		"0800014500":"山东分公司",
		"0800014520":"青岛分公司",
		"0800014900":"河南分公司",
		"0800015210":"湖北分公司",
		"0800015500":"湖南分公司",
		"0800015800":"广东分公司",
		"0800015840":"深圳分公司",
		"0800016100":"广西分公司",
		"0800016400":"海南分公司",
		"0800016500":"四川分公司",
		"0800016530":"重庆分公司",
		"0800017000":"贵州分公司",
		"0800017310":"云南分公司",
		"0800017700":"西藏分公司",
		"0800017900":"陕西分公司",
		"0800018200":"甘肃分公司",
		"0800018500":"青海分公司",
		"0800018700":"宁夏分公司",
		"0800018800":"新疆分公司"
	};
	
	return function(options) {
		var inst = options.args[0];
		
		if($.inArray(inst, bmiInst) == -1){
			var view = new MainView({insIdCd:inst, insNm:branchMap[inst]}).el;
			bmiInst.push(inst);
			
			sandbox.once('initialized', function(){
				$(options.elements).html(view);
			});
		}
	}
});